{
    "samples": {
        "ww2": "World War II or the Second World War, often abbreviated as WWII or WW2, was a global conflict that lasted from 1939 to 1945. The vast majority of the world's countries, including all of the great powers, fought as part of two opposing military alliances: the Allies and the Axis. Many participants threw their economic, industrial, and scientific capabilities behind this total war, blurring the distinction between civilian and military resources. Aircraft played a major role, enabling the strategic bombing of population centres and the delivery of the only two nuclear weapons ever used in war.\n\nWorld War II was by far the deadliest conflict in history, resulting in an estimated 70 to 85 million fatalities, mostly among civilians. Tens of millions died due to genocides (including the Holocaust), starvation, massacres, and disease. In the wake of the Axis defeat, Germany and Japan were occupied, and war crimes tribunals were conducted against German and Japanese leaders.\n\nThe causes of World War II are debated, but contributing factors included the Second Italo-Ethiopian War, Spanish Civil War, Second Sino-Japanese War, Soviet-Japanese border conflicts, the rise of fascism in Europe, and European tensions in the aftermath of World War I. World War II is generally considered to have begun on 1 September 1939, when Nazi Germany, under Adolf Hitler, invaded Poland. The United Kingdom and France subsequently declared war on Germany on 3 September. Under the Molotov-Ribbentrop Pact of August 1939, Germany and the Soviet Union had partitioned Poland and marked out their \"spheres of influence\" across Finland, Estonia, Latvia, Lithuania and Romania. From late 1939 to early 1941, in a series of campaigns and treaties, Germany conquered or controlled much of continental Europe, in a military alliance with Italy, Japan and other countries called the Axis. Following the onset of campaigns in North Africa and East Africa, and the fall of France in mid-1940, the war continued primarily between the European Axis powers and the British Empire, with war in the Balkans, the aerial Battle of Britain, the Blitz of the United Kingdom, and the Battle of the Atlantic. On 22 June 1941, Germany led the European Axis powers in an invasion of the Soviet Union, opening the Eastern Front, the largest land theatre of war in history.\n\nJapan, which aimed to dominate Asia and the Pacific, was at war with the Republic of China by 1937. In December 1941, Japan attacked American and British territories with near-simultaneous offensives against Southeast Asia and the Central Pacific, including an attack on the U.S. fleet at Pearl Harbor which resulted in the United States and United Kingdom declaring war against Japan. The European Axis powers declared war on the United States in solidarity. Japan soon captured much of the western Pacific, but its advances were halted in 1942 after losing the critical Battle of Midway; later, Germany and Italy were defeated in North Africa and at Stalingrad in the Soviet Union. Key setbacks in 1943—including a series of German defeats on the Eastern Front, the Allied invasions of Sicily and the Italian mainland, and Allied offensives in the Pacific—cost the Axis powers their initiative and forced them into strategic retreat on all fronts. In 1944, the Western Allies invaded German-occupied France, while the Soviet Union regained its territorial losses and pushed Germany and its allies back. During 1944 and 1945, Japan suffered reversals in mainland Asia, while the Allies crippled the Japanese Navy and captured key western Pacific islands.\n\nThe war in Europe concluded with the liberation of German-occupied territories and the invasion of Germany by the Western Allies and the Soviet Union, culminating in the Fall of Berlin to Soviet troops, Hitler's suicide, and the German unconditional surrender on 8 May 1945. Following the refusal of Japan to surrender on the terms of the Potsdam Declaration (issued 26 July 1945), the United States dropped the first atomic bombs on the Japanese cities of Hiroshima on 6 August and Nagasaki on 9 August. Faced with an imminent invasion of the Japanese archipelago, the possibility of additional atomic bombings, and the Soviet Union's declared entry into the war against Japan on the eve of invading Manchuria, Japan announced on 10 August its intention to surrender, signing a surrender document on 2 September 1945.",
        "trivia": "What does \"www\" stand for in a website browser?\n\nAnswer: World Wide Web\n\nHow long is an Olympic swimming pool (in meters)?\n\nAnswer: 50 meters\n\nWhat countries made up the original Axis powers in World War II?\n\nAnswer: Germany, Italy, and Japan\n\nWhich country do cities of Perth, Adelade & Brisbane belong to?\n\nAnswer: Australia\n\nWhat geometric shape is generally used for stop signs?\n\nAnswer: Octagon\n\nWhat is \"cynophobia\"?\n\nAnswer: Fear of dogs\n\nWhat punctuation mark ends an imperative sentence?\n\nAnswer: A period or exclamation point\n\nWho named the Pacific Ocean?\n\nAnswer: Ferdinand Magellan\n\nHow many languages are written from right to left?\n\nAnswer: 12\n\nQ: How many countries still have Shilling as currency? Bonus point: Which countries?\n\nAnswer: Four, Kenya, Uganda, Tanzania, and Somalia\n\nWhat is the name of the man who launched eBay back in 1995?\n\nAnswer: Pierre Omidyar\n\nWhat is the name of the biggest technology company in South Korea?\n\nAnswer: Samsung\n\nWhich animal can be seen on the Porsche logo?\n\nAnswer: Horse\n\nWhich monarch officially made Valentine's Day a holiday in 1537?\n\nAnswer: Henry VIII\n\nWho was the first woman to win a Nobel Prize (in 1903)?\n\nAnswer: Marie Curie\n\nThe first dictionary was written by?\n\nAnswer: Robert Cawdrey\n\nWorship of Krishna is observed by which Religious Faith?\n\nAnswer: Hinduism\n\nWhat is the name of the World's largest ocean?\n\nAnswer: Pacific Ocean\n\nDemolition of the Berlin wall separating East and West Germany began in what year?\n\nAnswer: 1989\n\nWhat is the romanized Arabic word for \"moon\"?\n\nAnswer: Qamar\n\nWho was the first woman pilot to fly solo across the Atlantic?\n\nAnswer: Amelia Earhart\n\nWhich two countries have not missed one of the modern-day Olympics?\n\nAnswer: Greece and Australia\n\nWhich is the only American Football team to go a whole season undefeated, including the Super Bowl?\n\nAnswer: The Miami Dolphins(1972)\n\nWho has won more tennis grand slam titles, Venus Williams or Serena Williams?\n\nAnswer: Serena Williams\n\nWhich Basketball team has completed two threepeats?\n\nAnswer: The Chicago Bulls\n\nWhich Former NBA Player Was Nicknamed \"Agent Zero\"?\n\nAnswer: Gilbert Arenas\n\nWhat sport is dubbed the \"king of sports\"?\n\nAnswer: Soccer\n\nWhat is the name of the professional ice hockey team based in Toronto, Canada?\n\nAnswer: Toronto Maple Leafs\n\nWho was the first gymnast to score a perfect 10 score?\n\nAnswer: Nadia Comaneci\n\nDump, floater, and wipe are terms used in which team sport?\n\nAnswer: Volleyball\n\nWho was the first female driver to score points in a Grand Prix?\n\nAnswer: Lella Lombardi (1975 Spanish Grand Prix)\n\nHow many points did Michael Jordan score on his first NBA game?\n\nAnswer: 16 points",
        "obama": "Barack Obama served as the 44th President of the United States. His story is the American story — values from the heartland, a middle-class upbringing in a strong family, hard work and education as the means of getting ahead, and the conviction that a life so blessed should be lived in service to others.\n\nWhen Barack Obama was elected president in 2008, he became the first African American to hold the office. The framers of the Constitution always hoped that our leadership would not be limited to Americans of wealth or family connections. Subject to the prejudices of their time—many of them owned slaves—most would not have foreseen an African American president. Obama's father, Barack Sr., a Kenyan economist, met his mother, Stanley Ann Dunham, when both were students in Hawaii, where Barack was born on August 4, 1961. They later divorced, and Barack's mother married a man from Indonesia, where he spent his early childhood. Before fifth grade, he returned to Honolulu to live with his maternal grandparents and attend Punahou School on scholarship.\n\nIn his memoir Dreams from My Father (1995), Obama describes the complexities of discovering his identity in adolescence. After two years at Occidental College in Los Angeles, he transferred to Columbia University, where he studied political science and international relations. Following graduation in 1983, Obama worked in New York City, then became a community organizer on the South Side of Chicago, coordinating with churches to improve housing conditions and set up job-training programs in a community hit hard by steel mill closures. In 1988, he went to Harvard Law School, where he attracted national attention as the first African American president of the Harvard Law Review. Returning to Chicago, he joined a small law firm specializing in civil rights.\n\nIn 1992, Obama married Michelle Robinson, a lawyer who had also excelled at Harvard Law. Their daughters, Malia and Sasha, were born in 1998 and 2001, respectively. Obama was elected to the Illinois Senate in 1996, and then to the U.S. Senate in 2004. At the Democratic National Convention that summer, he delivered a much acclaimed keynote address. Some pundits instantly pronounced him a future president, but most did not expect it to happen for some time. Nevertheless, in 2008 he was elected over Arizona Senator John McCain by 365 to 173 electoral votes.\n\nAs an incoming president, Obama faced many challenges—an economic collapse, wars in Iraq and Afghanistan, and the continuing menace of terrorism. Inaugurated before an estimated crowd of 1.8 million people, Obama proposed unprecedented federal spending to revive the economy and also hoped to renew America's stature in the world. During his first term he signed three signature bills: an omnibus bill to stimulate the economy, legislation making health care more accessible and affordable, and legislation reforming the nation's financial institutions. Obama also pressed for a fair pay act for women, financial reform legislation, and efforts for consumer protection. In 2009, Obama became the fourth president to receive the Nobel Peace Prize.\n\nIn 2012, he was reelected over former Massachusetts Governor Mitt Romney by 332 to 206 electoral votes. The Middle East remained a key foreign policy challenge. Obama had overseen the killing of Osama bin Laden, but a new self-proclaimed Islamic State arose during a civil war in Syria and began inciting terrorist attacks. Obama sought to manage a hostile Iran with a treaty that hindered its development of nuclear weapons. The Obama administration also adopted a climate change agreement signed by 195 nations to reduce greenhouse gas emissions and slow global warming.\n\nIn the last year of his second term, Obama spoke at two events that clearly moved him—the 50th anniversary of the civil rights march from Selma to Montgomery, and the dedication of the National Museum of African American History and Culture. \"Our union is not yet perfect, but we are getting closer,\" he said in Selma. \"And that's why we celebrate,\" he told those attending the museum opening in Washington, \"mindful that our work is not yet done.\""
    }
}